Repository: wp-plugins/m7-go-top
Catalog: languages/m7-go-top-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: FAQ
ru_ru: Документация

source: Donate
ru_ru: Пожертвовать

# submenu page save changes
source: Save
ru_ru: Сохранить

source: Disable plugin
ru_ru: Отключить плагин

source: If checked plugin won't work in front-end
ru_ru: Если выбрано, то плагин не будет работать вне админки

source: Show from
ru_ru: Показывать с

source: Distance from the top of the page after which button will appear
ru_ru: Расстояние от начала страницы с которого будет появляться кнопка

source: Show from unit
ru_ru: Измерение в

source: You can specify "Show from" in pixels or percentages
ru_ru: Служит для поля \"показывать с\" и имеет 2 значения: пиксели и проценты. Т.е. показывать с 10% или 300 пикселей

source: Pixels ( px )
ru_ru: Пиксели ( px )

source: Percentage ( % )
ru_ru: Проценты ( % )

source: Scroll speed
ru_ru: Скорость прокрутки

source: How fast should button get to top in milliseconds ( 1000 milliseconds = 1 second )
ru_ru: Как быстро будет происходить прокрутка до верха в миллисекундах ( 1000 миллисекунд = 1 секунда )

source: Button type
ru_ru: Тип кнопки

source: Select how to display "m7 go top" button
ru_ru: Выберите как следует отображать кнопку

source: Button
ru_ru: Кнопка

source: vk.com style
ru_ru: В стиле vk.com

source: Image
ru_ru: Картинка

source: Button text
ru_ru: Текст кнопки

source: Enter text that will be displayed in button.<br />If "Button type" is set to image these text will be placed in alt param of img
ru_ru: Введите текст который будет отображаться в кнопке. Если \"Тип кнопки\" картинка, то текст будет помещён в параметр alt у картинки

source: Up
ru_ru: Наверх

source: Button image
ru_ru: Картинка кнопки

source: Copy-paste image url or select from library
ru_ru: Скопируйте и вставьте ссылку на картинку или выберите из галлереи

source: Select
ru_ru: Выбрать

source: Upload Image
ru_ru: Загрузить картинку

source: Button hover image
ru_ru: Картинка кнопки при наведении

source: Text font size
ru_ru: Размер текста

source: Font size (height of text)
ru_ru: Можете задать размер текста

source: Text font size unit
ru_ru: Размер шрифта в

source: Select font size unit
ru_ru: Выберите в чём измерять размер шрифта

source: Pixels (px)
ru_ru: Пиксели ( px )

source: Percentage (%)
ru_ru: Проценты ( % )

source: Points (pt)
ru_ru: Пункты ( pt )

source: Width
ru_ru: Ширина

source: Width of the button in pixels (px)
ru_ru: Ширина кнопки в пикселях

source: Height
ru_ru: Высота

source: Height of the button in pixels (px)
ru_ru: Высота кнопки в пикселях ( px )

source: Wertical align
ru_ru: Вертикальное расположение

source: Where to show button
ru_ru: Где отображать кнопку

source: Top
ru_ru: Наверху

source: Bottom
ru_ru: Внизу

source: Horizontal align
ru_ru: Горизонтальное расположение

source: Left
ru_ru: Слева

source: Right
ru_ru: Справа

source: Offset top
ru_ru: Отступ сверху

source: Offset from top of browser in pixels (px)
ru_ru: Отступ сверху от браузера в пикселях ( px )

source: Offset bottom
ru_ru: Отступ снизу

source: Offset from bottom of browser in pixels (px)
ru_ru: Отступ снизу от браузера в пикселях ( px )

source: Offset left
ru_ru: Отступ слева

source: Offset from left of browser in pixels (px)
ru_ru: Отступ слева от браузера в пикселях ( px )

source: Offset right
ru_ru: Отступ справа

source: Offset from right of browser in pixels (px)
ru_ru: Отступ справа от браузера в пикселях

source: Padding left
ru_ru: Доп. отступ слева ( padding left )

source: Padding of link in pixels (px)
ru_ru: Доп. отступ кнопки в пикселях ( px )

source: Padding right
ru_ru: Доп. отступ справа ( padding right )

source: <span>Padding will be applyed to wrapper and will make wrapper wider for value you have entered. These way when people will move their mouse to wrapper the button will become hovered</span>
ru_ru: <span>Доп. отступ будет применён к враперу тем самым сделав его пире на указанное значение. Таким образом при наведении на врапер кнопка будет иметь наведённое состояние</span>

source: Opacity
ru_ru: Прозрачность

source: Opacity on default state. Number from 0 to 10 where 0 stands for transparent and 10 - visible
ru_ru: Прозрачность в стандартном положении. Число от 0 до 10, где 0 это прозрачный, а 10 - видимый

source: Opacity on hover
ru_ru: Прозрачность при наведении

source: Opacity on hovers. Number from 0 to 10 where 0 stands for transparent and 10 - visible
ru_ru: Прозрачность при наведении. Число от 0 до 10, где 0 это прозрачный, а 10 - видимый

source: Wrapper color
ru_ru: Цвет фона

source: Select wrapper background color
ru_ru: Выберите цвет фона

source: Wrapper hover color
ru_ru: Цвет фона при наведении

source: Select wrapper background hover color
ru_ru: Выберите цвет фона при наведении

source: Text color
ru_ru: Цвет текста

source: Select text color
ru_ru: Выберите цвет текста

source: Text hover color
ru_ru: Цвет текста при наведении

source: Select text hover color
ru_ru: Выберите цвет текста при наведении

source: Enable border
ru_ru: Включить границу ( border )

source: If checked you'll be abel to set border
ru_ru: Если выбрано, то вы сможете настроить границу ( border )

source: Border width
ru_ru: Ширина границы ( border )

source: Set border width
ru_ru: Задайте ширину границы ( border )

source: Border style
ru_ru: Стиль границы ( border )

source: Select border style
ru_ru: Выберите стиль границы ( border )

source: Dotted
ru_ru: Точками ( dotted )

source: Dashed
ru_ru: Линиями ( dashed )

source: Solid
ru_ru: Сплошная ( solid )

source: Double
ru_ru: Двойная ( double )

source: Border color
ru_ru: Цвет границы ( border )

source: Select border color
ru_ru: Выберите цвет границы ( border )

source: Enable border radius
ru_ru: Включить закругление

source: If checked you'll be abel to set border radius
ru_ru: Если выбрано вы сможете задать закругление ( border-radius )

source: Border radius top left
ru_ru: Закругление сверху слева

source: Top left border radius
ru_ru: Закругление сверху слева

source: Border radius top right
ru_ru: Закругление сверху справа

source: Top right border radius
ru_ru: Закругление сверху справа

source: Border radius bottom left
ru_ru: Закругление снизу слева

source: Bottom left border radius
ru_ru: Закругление снизу слева

source: Border radius bottom right
ru_ru: Закругление снизу справа

source: Bottom right border radius
ru_ru: Закругление снизу справа

source: Enable text shadow
ru_ru: Включить тень текста

source: If checked you'll be abel to set text shadow
ru_ru: Если выбрано вы сможете задать тень для текста ( text-shadow )

source: Text shadow x position
ru_ru: Отступ по x

source: The position of the horizontal shadow. Negative values are allowed
ru_ru: Горизонтальная позиция тени. Допускаются отрицательные значения

source: Text shadow y position
ru_ru: Отступ по y

source: The position of the vertical shadow. Negative values are allowed
ru_ru: Вертикальная позиция тени. Допускаются отрицательные значения

source: Text shadow blur
ru_ru: Размытие тени

source: The blur distance
ru_ru: Дальность размытия тени текста

source: Text shadow color
ru_ru: Цвет тени

source: The color of the shadow.
ru_ru: Выберите цвет тени текста

source: Enable box shadow
ru_ru: Включить тень блока

source: If checked you'll be abel to set box shadow
ru_ru: Если выбрано вы сможете задать тень блока ( box-shadow )

source: Box shadow x position
ru_ru: Отступ тени по x

source: Box shadow y position
ru_ru: Отступ тени по y

source: Box shadow blur
ru_ru: Размытие тени

source: Box shadow size
ru_ru: Размер тени

source: The size of shadow
ru_ru: Размер тени ( size )

source: Box shadow inset
ru_ru: Внутренняя тень

source: Changes the shadow from an outer shadow (outset) to an inner shadow. If checked will use inner
ru_ru: Меняет значение тени из внешнее на внутреннее. Если выбрано, то будет внутренняя

source: Wrapper class
ru_ru: Класс враппера

source: You can specify wrapper class
ru_ru: Вы можете задать класс к врапперу

source: Link class
ru_ru: Класс ссылки

source: You can specify link class
ru_ru: Вы можете задать класс ссылке

source: Span class
ru_ru: Класс спана

source: You can specify span class
ru_ru: Вы можете задать класс спану ( span )

source: Image class
ru_ru: Класс картинки

source: You can specify image class
ru_ru: Вы можете задать класс картинке

source: Custom styles
ru_ru: Пользовательские стили

source: You can add custom styles
ru_ru: Вы можете добавить свои стили

# donate title
source: Donate to suppot WordPress Plugin Development
ru_ru: Пожертвуйте что бы поддержать разработку WordPress плагинов

# donate text
source: <p>I spend a much of my spare time as possible working on WordPress plugins and themes and any donation is appreciated. Donations play a crucial role in supporting Free and Open Source Software projects.</p> <p>So why are donations important? As a developer the more donations I receive the more time I can invest in working on Free and Open Source Software projects. Donations help cover the cost of hardware for development and to pay hosting bills. <strong>This is critical to the development of free software.</strong></p> <p>I know a lot of other developers do the same and I try to donate to them whenever I can. As a developer I greatly appreciate any donation you can make to help support further development of quality plugins and themes for WordPress as well as other open source software.</p>
ru_ru: <p>Я провожу большую часть свободного времени разрабатывая темы и плагины для WordPress и пожертвования с Вашей стороны очень ценятся. Пожертвования играют важную роль в поддержке и разработке бесплатных плагинов.</p> <p>SПочему же пожертвования так важны? Как разработчик, чем больше я получаю пожертвований, тем больше я могу сосредоточиться на разработке бесплатных тем и плагинов. <strong>Пожертвования очень важны в разработке бесплатных плагинах</strong></p> <p>Я знаю, что многие разработчики поступают точно так же и я стараюсь пожертвовать им когда это возможно. Как разработчик я очень ценю любое пожертвование которое Вы можете сделать для улучшения качества тем и плагинов разрабатываемых под WordPress.</p>

# credits plugin
source: Plugin Web Site (in development)
ru_ru: Страница плагина ( в разработке )

# credits "and"
source: and
ru_ru: и

# credits author
source: Author Web Site (in development)
ru_ru: страница Автора ( в разработке )

source: Validation has not been passed
ru_ru: Валидация не пройдена

source: Box shadow color
ru_ru: Цвет тени
